import React from 'react'
import './Servers.css'
import imgservers from './R.jpg'

const Servers = () => {
  return (
    <div className='servers'>
        <div className='frontend-serv all-cp'>
            <h2>مبرمج الواجهات الامامية</h2>
            <div className="note">
                <h3>مرحلة التفكير</h3>
                <p>مرحلة التفكير هي اهم خطوة في معرفة الطريقة التي سوف اعمل بها يتم تقسيم الموقع الي عدد أجزاء أولا ما هي الشكلة التي سوف يحلها الموقع أو ما هي فكرته  ثانيا التصميم و بعد ذلك مرحلة كتابة الكود و يتم تقسيم هذه الخطوات الي خطوات اصغر ليكون الموضوع أوضح</p>
            </div>
            <div className="note">
                <h3>مرحلة التصميم</h3>
                <p>و هنا يتم تصميم الموقع و كيفية عرض المعلومات علي المستخدم و في هذا المرحلة يتم Figma أو Adobe XD  استخدام عددة تطبيقات مثل ومن هذه المرحلة يتم تحديد ايضا التجاوبية هي عبارة عن ماذا سوف يكون شكل الموقع علي الهواتف و الشاشات المختلفة </p>
   
            </div>
            <div className="note">
                <h3>مرحلة البرمجة</h3>
                <p>و من هنا يتم تحويل التصميم من مجرد صورة  عادية  الي موقع تفاعلي</p>
                <p>HTML CSS JAVASCRIPT باستخدام</p>
            </div>

        </div>







        <div className='backend-serv all-cp'>
            <h2>مبرمج المواجهات الخلفية  </h2>

            <div className="note">
                <h3>مرحلة تحضير الخادم </h3>
                <p>المرحلة التي يتم انشاء قواعد البيانات المختلفة   و الخادم الذي سوف يتلقي الطلبات من والي  الخادم </p>
            </div>

            <div className="note">
                <h3>API مرحلة اعداد </h3>
                <p>المرحلة التي يتم فيها ارسال المعلومات الذي طلب المستخدم عرضها علي الموقع يتم استلامها في المتصفح الخاص بالمستخدم  </p>
            </div>

            <div className="note">
                <h3>API مرحلة استلام </h3>
                <p> هذه المرحلة تتم في المتصفح الخاص بالمستخدم و التي يتم استلام الطلبات التي طلبها المستخدم من الخادم   </p>
            </div>


        </div>
    </div>
  )
}

export default Servers